The newly created object is not visible in the current view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NewElementInvisibleInCurrentView { get; }
  Visual Basic
Public Shared ReadOnly Property NewElementInvisibleInCurrentView As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NewElementInvisibleInCurrentView {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeneralFailures Class
  Autodesk.Revit.DB Namespace